"use strict";

// 1. Оголоси дві змінні, productName для назви товару і pricePerItem для зберігання ціни за штуку. При оголошенні надай змінним наступні характеристики товару:

// назва - рядок "Droid"
// ціна за штуку - число 2000
// Виведи змінні у консоль

// 2. Ім'я товару змінили на "Repair droid" та збільшили його ціну на 1500 кредитів.

// Перевизнач значення змінних pricePerItem і productName після їх оголошення.
// Виведи змінні у консоль

// 3. Оголоси наступні змінні, використовуючи ключове слово const і надай їм відповідні значення.

// topSpeed ​​- число 160.
// distance – число 617.54.
// login - рядок "mango935".
// isOnline - буль true.
// isAdmin - буль false.
// Виведи змінні у консоль використовуючи метод typeof

// 4. Оголоси наступні змінні:
// - pricePerItem = 3500
// - orderedQuantity = 4
// - totalPrice
// Доповни код, надавши змінній totalPrice вираз для підрахунку загальної суми замовлення.
// Виведи значення totalPrice в консоль

// 5. Оголоси наступні змінні:
// - productName = "Droid"
// - price = 3500
// Оголоси змінну message та запиши в неї повідомлення про купівлю, рядок у форматі: "You picked <ім'я товару>, price per item is <ціна товару> credits".
// Де < ім'я товару> і <ціна товару> це значення змінних productName і pricePerItem. Використовуй синтаксис шаблонних рядків - `текст` ${змінна}.
// Виведи значення message в консоль

// 6. Оголоси змінні та надай їм відповідні значення:
//  - pricePerDroid - ціна одного дроїда, значення 800.
//  - ordered - кількість дроїдів у замовленні, значення 6.
//  - deliveryFee - вартість доставки, значення 50.
//  - total - загальна сума замовлення до оплати, не забудь про вартість доставки.
//  - message - повідомлення про стан замовлення у форматі "Ви знайдете droids worth <total price> credits. Delivery (<delivery fee> credits) is included in total price."
// Використовуй синтаксис шаблонних рядків.
// Виведи значення message в консоль.
