"use strict";
// Завдання з циклом for

// Сума чисел від 1 до 100:

// Завдання: Напишіть програму, яка за допомогою циклу for обчислює суму всіх чисел від 1 до 100 і виводить результат.

// console.log("Сума чисел від 1 до 100:", sum);

// Завдання: Напишіть програму, яка за допомогою циклу for виводить таблицю множення на 5 (від 1 до 10).

// console.log(`5 * ${i} = ${5 * i}`);

// Завдання: Напишіть програму, яка виводить усі парні числа від 1 до 50 за допомогою циклу for.

//     console.log(i);

// Завдання: Напишіть програму, яка виводить числа від 10 до 1 у зворотному порядку за допомогою циклу for.

//     console.log(i);

// Завдання: Напишіть програму, яка за допомогою циклу while приймає числа, введені користувачем, і виводить їх суму.
// Програма повинна завершуватися, якщо користувач введе число 0.

// console.log("Сума введених чисел:", sum);

// Завдання: Напишіть програму, яка за допомогою циклу while знаходить і виводить найменший дільник числа, введеного користувачем (крім 1).

// let number = 15;
// let divisor = 2;

// console.log("Найменший дільник числа:", divisor);

// Завдання: Напишіть програму, яка запитує у користувача число від 1 до 10.
// Якщо введене число виходить за межі цього діапазону, програма повинна повторно запитувати введення доти, поки користувач не введе правильне число.

// let number;
// do {
//     number = 0;
// } while ();
// console.log("Введене правильне число:", number);

// Завдання: Напишіть програму, яка виводить повідомлення "Привіт!" 5 разів, використовуючи цикл do..while.

// let count = 0;

//     console.log("Привіт!");

// Завдання: Напишіть програму, яка запитує у користувача пароль і продовжує запитувати його доти, поки користувач не введе правильний пароль (наприклад, "12345").

// const correctPassword = "12345";
// let password;

// do {
//     password = 0;
// } while ();
// console.log("Пароль вірний!");

// Завдання: Напишіть програму, яка приймає від користувача кілька чисел, використовуючи цикл do..while, і знаходить мінімальне з введених чисел.
// Цикл припиняється, коли користувач вводить число 0.

// let min;
// let number;
// do {
//     number = 0;
//     if () {
//
//     }
// } while ();
// console.log("Мінімальне введене число:", min);
