"use strict";

// Завдання 1: Створення та доступ до елементів масиву

// Створи масив із назвами п’яти улюблених фруктів.
// Виведи в консоль назву першого і третього фрукта з цього масиву.
// Замінити другий фрукт в масиві на новий на приклад "Cherry".

const fruits = ["Apple", "Banana", "Orange", "Grapes", "Mango"];

console.log();

// Завдання 2: Ітерація по масиву

// Створи масив із назвами п’яти міст.
// Виведи в консоль довжину масиву та останній елемент.
// За допомогою циклу for виведи всі назви міст на екран.

const cities = ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"];

// Завдання 3: Використання операторів break та continue

// Створи масив із чисел.
// Використовуючи цикл for, виведи тільки ті числа, що більші за 5.
// Додай до попереднього завдання перевірку: якщо знайдено число 8, зупини виконання циклу (break).

const numbers = [1, 3, 6, 23, 68, 17, 8, 5, 10, 15, 20, 25];

// Завдання 4: Методи масиву

// Створи масив з назвами кольорів: "red", "green", "blue".
// Додай в цей масив колір "yellow" після "green" за допомогою методу splice.
// Видали останній колір у масиві за допомогою методу pop.
// Об’єднай масив із кольорами з іншим масивом, що містить два нові кольори: "black" і "white", використовуючи метод concat.

const colors = ["Red", "Blue", "Green", "Yellow", "Purple"];

const moreColors = ["black", "white"];

// Завдання 5: Робота з рядками та масивами

// Є рядок: "HTML,CSS,JavaScript". Розділи цей рядок на окремі слова, створивши масив за допомогою методу split.
// Об’єднай цей масив в один рядок, розділивши слова пробілами за допомогою методу join.
// Знайди індекс слова "JavaScript" в отриманому масиві за допомогою методу indexOf.
// Перевір, чи міститься слово "React" у масиві за допомогою методу includes.

const techString = "HTML,CSS,JavaScript";

// Завдання 6: Використання методу splice

// Створи масив з п'яти чисел: [1, 2, 3, 4, 5].
// Видали другий і третій елементи цього масиву.
// На місце видалених елементів встав числа 10 і 20.

const numbersArray = [1, 2, 3, 4, 5];
