// Задача 1: Створення та доступ до властивостей об'єкта

// Створіть об'єкт car, що містить такі властивості: brand (марка автомобіля), model (модель), year (рік випуску) та color (колір).
// Отримайте значення властивості model та виведіть його у консоль.

const car = {
  brand: "Toyota",
  model: "Corolla",
  year: 2020,
  color: "blue",
};

console.log();

// Задача 2: Вкладені властивості

// Створіть об'єкт laptop, що містить вкладені об'єкти для опису характеристик процесора та пам'яті.
// Процесор(processor) має властивості brand(бренд) та speed(швидкість), а пам'ять (memory) - властивості type (тип) та size (розмір).
// Отримайте значення властивості brand процесора та виведіть його у консоль.

const laptop = {
  processor: {
    brand: "Intel",
    speed: "2.6GHz",
  },
  memory: {
    type: "DDR4",
    size: "16GB",
  },
};
console.log();

// Задача 3: Зміна властивостей об'єкта

// Є об'єкт phone, що містить властивості brand, model та price.
// Змініть значення властивості price на нове значення та додайте нову властивість isAvailable, яка буде мати значення true.

const phone = {
  brand: "Samsung",
  model: "Galaxy S21",
  price: 799,
};

console.log();

// Задача 4: Метод об'єкта

// Створіть об'єкт user, що містить масив friends з іменами друзів та метод addFriend, який приймає ім'я друга як аргумент і додає його до масиву friends.
// Викличте метод для додавання нового друга.

const user = {
  friends: ["Alice", "Bob"],
};

console.log();

// Задача 5: Перебирання об'єкта

// Є об'єкт store, що містить товари у вигляді пар ключ:значення, де ключ - це назва товару, а значення - його кількість.
// Порахуйте загальну кількість усіх товарів в об'єкті (Object.values) та виведіть результат у консоль (Цикл for of).

const store = {
  apples: 50,
  oranges: 30,
  bananas: 100,
};

console.log();
